Para guardar un CSV de tu DataFrame 'df' sin guardar el índice y con el separador '|' usas:

Si deseas leer la primera hoja (Sheet1) de un archivo en Excel, usas:

Pensando en una buena compresión de los datos, ¿cuál sería el formato más apropiado?
Ten en cuenta que el DataFrame original posee unos 100.000 registros con unas 30 variables de tipo número, categoría y texto. ES POSIBLE QUE SEA PARQUET

Si quiero unir dos DataFrames (df1, df2), puedo usar: YO HABIA USADO EL pd.concat() no es

Dado:

df = pd.DataFrame({
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'F', 'M', 'M', 'M', 'F', 'F', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}, index = ['Ana','Benito','Camilo','Daniel','Erika','Paola','Gabriela']) 
¿Cuál es la edad promedio de las mujeres? habia elegido

In [1]:
import numpy as np
import pandas as pd

In [19]:
df1 = pd.DataFrame({ 'edad' : [ 10, 9, 13, 14, 12, 11, 12], 
                   'cm' : [ 115, 110, 130, 155, 125, 120, 125], 
                   'pais' : [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'], 
                   'genero' : [ 'F', 'M', 'M', 'M', 'F', 'F', 'F'], 
                   'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3], 
                   'Q2' : [ 7, 9, 9, 8, 8, 8, 9.] }, 
                  index = ['Ana','Benito','Camilo','Daniel','Erika','Paola','Gabriela'])

In [8]:
df.groupby('genero')[['edad']].mean() ## 11,25

         edad
genero
F       11.25
M       12.00

In [6]:
%cd ../base

C:\Users\GAMER\Documents\Development\curso_python\base

### Guardar un dataframe como archivo csv

In [12]:
df.to_csv('/Users/GAMER/Documents/Development/curso_python/base/text.csv', index = False, sep='|')

In [14]:
# !ls

In [16]:
df2 = pd.DataFrame({ 'Notas':[5.1,7.5,8.0,8.1,9.0,5.0,2.0]},
                  index = ['Ana','Benito','Camilo','Daniel','Erika','Paola','Gabriela'])

In [17]:
df2

          Notas
Ana         5.1
Benito      7.5
Camilo      8.0
Daniel      8.1
Erika       9.0
Paola       5.0
Gabriela    2.0

In [22]:
pd.concat([df1,df2]) ### Simplemente esta pegando la tabla abajo, no las une

          edad     cm pais genero    Q1   Q2  Notas
Ana       10.0  115.0   co      F   5.0  7.0    NaN
Benito     9.0  110.0   mx      M  10.0  9.0    NaN
Camilo    13.0  130.0   co      M   8.0  9.0    NaN
Daniel    14.0  155.0   mx      M   NaN  8.0    NaN
Erika     12.0  125.0   mx      F   7.0  8.0    NaN
Paola     11.0  120.0   ch      F   8.0  8.0    NaN
Gabriela  12.0  125.0   ch      F   3.0  9.0    NaN
Ana        NaN    NaN  NaN    NaN   NaN  NaN    5.1
Benito     NaN    NaN  NaN    NaN   NaN  NaN    7.5
Camilo     NaN    NaN  NaN    NaN   NaN  NaN    8.0
Daniel     NaN    NaN  NaN    NaN   NaN  NaN    8.1
Erika      NaN    NaN  NaN    NaN   NaN  NaN    9.0
Paola      NaN    NaN  NaN    NaN   NaN  NaN    5.0
Gabriela   NaN    NaN  NaN    NaN   NaN  NaN    2.0

In [32]:
df.append(df2)

          edad     cm pais genero    Q1   Q2  Notas
Ana       10.0  115.0   co      F   5.0  7.0    NaN
Benito     9.0  110.0   mx      M  10.0  9.0    NaN
Camilo    13.0  130.0   co      M   8.0  9.0    NaN
Daniel    14.0  155.0   mx      M   NaN  8.0    NaN
Erika     12.0  125.0   mx      F   7.0  8.0    NaN
Paola     11.0  120.0   ch      F   8.0  8.0    NaN
Gabriela  12.0  125.0   ch      F   3.0  9.0    NaN
Ana        NaN    NaN  NaN    NaN   NaN  NaN    5.1
Benito     NaN    NaN  NaN    NaN   NaN  NaN    7.5
Camilo     NaN    NaN  NaN    NaN   NaN  NaN    8.0
Daniel     NaN    NaN  NaN    NaN   NaN  NaN    8.1
Erika      NaN    NaN  NaN    NaN   NaN  NaN    9.0
Paola      NaN    NaN  NaN    NaN   NaN  NaN    5.0
Gabriela   NaN    NaN  NaN    NaN   NaN  NaN    2.0

In [35]:
df1.join(df2)

          edad   cm pais genero    Q1   Q2  Notas
Ana         10  115   co      F   5.0  7.0    5.1
Benito       9  110   mx      M  10.0  9.0    7.5
Camilo      13  130   co      M   8.0  9.0    8.0
Daniel      14  155   mx      M   NaN  8.0    8.1
Erika       12  125   mx      F   7.0  8.0    9.0
Paola       11  120   ch      F   8.0  8.0    5.0
Gabriela    12  125   ch      F   3.0  9.0    2.0

ahora si lo quieres hacer a lo largo de las columnas para que se vea mejor

In [44]:
df.shape

(7, 6)

In [45]:
print(df.query("(edad >= 12) & (cm < 130) & (Q1 > 5)")['Q2'])

Erika    8.0
Name: Q2, dtype: float64

In [25]:
df_left = pd.DataFrame(
    {'X':['x0','x1','x2','x3'],
    'W':['w0','w1','w2','w3'],
    'Y':['y0','y1','y2','y3'],
    'Mix':['y2','y3','a2','a3']},
    index = ['y2','y3','a2','a3'])

df_right = pd.DataFrame(
    {'Z':['z2','z3','z4','z5'],
     'A':['a2','a3','a4','a5'],
     'Y':['y2','y3','y4','y5']},
    index = [2,3,4,5])

In [26]:
df = pd.DataFrame({
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'F', 'M', 'M', 'M', 'F', 'F', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}, index = ['Ana','Benito','Camilo','Daniel','Erika','Paola','Gabriela'])

In [27]:
print(df.loc[['Ana'],['cm']])

      cm
Ana  115

In [28]:
df = pd.DataFrame({
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'F', 'M', 'M', 'M', 'F', 'F', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}, index = ['Ana','Benito','Camilo','Daniel','Erika','Paola','Gabriela'])

In [30]:
df[(df['edad']>12) & (df['pais']=='mx')]

        edad   cm pais genero  Q1   Q2
Daniel    14  155   mx      M NaN  8.0

In [31]:
pd.Series([10,8,5,0]) - pd.Series([0,1,6,12])

0    10
1     7
2    -1
3   -12
dtype: int64

In [36]:
print(df.iloc[[4],[2]])

      pais
Erika   mx

In [37]:
df.drop(columns=['edad'])

           cm pais genero    Q1   Q2
Ana       115   co      F   5.0  7.0
Benito    110   mx      M  10.0  9.0
Camilo    130   co      M   8.0  9.0
Daniel    155   mx      M   NaN  8.0
Erika     125   mx      F   7.0  8.0
Paola     120   ch      F   8.0  8.0
Gabriela  125   ch      F   3.0  9.0

In [38]:
print(df['edad'] >= 12)

Ana         False
Benito      False
Camilo       True
Daniel       True
Erika        True
Paola       False
Gabriela     True
Name: edad, dtype: bool

In [ ]:
df.to_csv()